{
  "name": "rahul sharma",
  "title": "software engineer",
  "description": "who loves designing systems and building reliable infrastructure. I do most of my work in Neovim and enjoy keeping things minimal and efficient unless I feel like vibe coding on cursor (which is apparently, a lot these  days :p). When I'm not coding, you'll probably find me running, doing bouldering, spending time with my girlfriend or immersed in a fantasy novel or classic literature.",
  "experience": [
    {
      "company": "HackerRank",
      "role": "Software Development Engineer II",
      "period": "Aug 2025 - Present",
      "highlights": [
        "Currently, working at HackerRank"
      ]
    },
    {
      "company": "Scaler/Interviewbit",
      "role": "Software Development Engineer II",
      "period": "Jul 2022 - Jul 2025",
      "highlights": [
        "Architected DaddyQuest: Multi-tenant Orchestration Platform for automated call/meeting analysis with 1 lakh+ monthly calls processing",
        "Engineered Mimir: CRM x Redshift ETL Pipeline, saving $440 monthly through custom in-house solution replacing Hevo",
        "Led security enhancement initiative by migrating production RDS from unencrypted to encrypted data at rest, significantly improving data protection and security posture.",
        "Developed Sail Extension AI-powered tool for real-time call transcription, improving conversion rates by 10%",
        "Implemented Lead Ranking System with ML, boosting conversion by 2% and adding 70 lakhs in extra revenue",
        "Designed and implemented Sail Quest API Microservice in Python using gRPC protocol, and a ROR gem to go with it as a client, transforming legacy S3-based architecture into a scalable, distributed system."
      ]
    },
    {
      "company": "HighRadius",
      "role": "Software Development Engineer Intern",
      "period": "Jan 2022 - May 2022",
      "highlights": [
        "Engineered AI-powered Admin interface predicting accounts receivable dates with 97% accuracy",
        "Reduced DSO (Days Sales Outstanding) by 15% and contributed to 12% increase in on-time payments",
        "Developed full-stack solution using ReactJS, Python, and SQL with integrated ML models"
      ]
    }
  ],
  "skills": {
    "languages": ["Python", "Ruby", "TypeScript", "C++", "Go", "SQL"],
    "frameworks": [
      "FastAPI",
      "ROR",
      "Celery",
      "Next.js",
      "Sidekiq",
      "LangChain",
      "LangGraph"
    ],
    "databases": [
      "MySQL",
      "MongoDB",
      "Redis",
      "Elasticsearch",
      "Redshift",
      "Postgres",
      "DynamoDB"
    ],
    "tools": ["AWS", "Docker", "Terraform", "gRPC", "Kafka"]
  },
  "contact": {
    "email": "holdmypotion@gmail.com",
    "github": "https://github.com/holdmypotion",
    "linkedin": "https://linkedin.com/in/holdmypotion"
  }
}
